---
title: ContinuousRail
classe: Autodesk.Revit.DB.Architecture.ContinuousRail
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ContinuousRail

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId HostRailingId { get; }` | `continuousRail.HostRailingId` | ElementId |
| `Double Length { get; }` | `continuousRail.Length` | Double |
| `IList<Curve> GetEndExtensionPath()` | `continuousRail.GetEndExtensionPath()` | IList<Curve> |
| `IList<Curve> GetPath()` | `continuousRail.GetPath()` | IList<Curve> |
| `IList<Curve> GetStartExtensionPath()` | `continuousRail.GetStartExtensionPath()` | IList<Curve> |
| `IList<ElementId> GetSupports()` | `continuousRail.GetSupports()` | IList<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```